* 確率分布

  
** 離散
   
*** 一様分布

    #+begin_src R :session t :results output :exprots both

hist(runif(10,0,1))

plot(dunif(1:10,1,10))

punif(5,1,10)
punif(6,1,10)
punif(7,1,10)
punif(8,1,10)
punif(9,1,10)
punif(10,1,10)
punif(2:10,1,10)


for (i in 1:10)  {
  cat(punif(i,1,10))
  }
    #+end_src

    #+RESULTS:
    : [1] 0.4444444
    : [1] 0.5555556
    : [1] 0.6666667
    : [1] 0.7777778
    : [1] 0.8888889
    : [1] 1
    : [1] 0.1111111 0.2222222 0.3333333 0.4444444 0.5555556 0.6666667 0.7777778
    : [8] 0.8888889 1.0000000
